Revit 2027 API
ImageType.Path Property
 The path to the file from which the ImageType was loaded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Path { get; }
Public ReadOnly Property Path As String
	Get
public:
property String^ Path {
	String^ get ();
}
member Path : string with get
Property Value
String
Remarks
The path string can be in one of several formats: absolute local, relative local, or server (indicating that the file was provided by an external server). The format is determined by PathType
The path can be an empty string, for example for (but not limited to) ImageTypes created using "Save to Project as Image".
See Also
Reference
ImageType Class
Autodesk.Revit.DB Namespace